FahrJo/STM32F4_Transportkontrollsystem/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2019 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "fatfs.h"

/* USER CODE BEGIN Includes */
#include "card_operations.h"
#include "acceleration_Sensor.h"
#include "gps_modul.h"
#include "ini.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c3;

SD_HandleTypeDef hsd;

SPI_HandleTypeDef hspi1;

UART_HandleTypeDef huart3;
DMA_HandleTypeDef hdma_usart3_rx;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
uint8_t GET_DATA;														 		/* Initialisierungswert fuer das Sammeln eines kompletten Datensatzes */

configuration config;

static int Preferences_Handler(void* user, const char* section, const char* name, const char* value);		/* Handler für Config-Parser */

const uint16_t 	datasetCount = 100;							/* Anzahl der Datensäetze, die gesammelt auf die Karte geschrieben werden */
uint16_t				actualSet = 0;									/* Momentan aktiver Datensatz */
ADC_AnalogWDGConfTypeDef AnalogWDGConf;

struct tm				clock_time;

FATFS 					myFatFS;
FIL 						logFile;												/* Dateihandle auf SD-Karte (Log-Datei) */
FIL 						configFile;											/* Dateihandle auf SD-Karte (Initialisierungsdatei)*/
UINT 						cursor;													/* Letztes Zeichen in CSV-Datei (Log-Datei) */
UINT 						configCursor;										/* Letztes Zeichen in CSV-Datei Initialisierungsdatei) */
char 						logFileName[] = "LogFile.csv";
char 						configFileName[] = "config.ini";
char * 					configBuffer;
char 						header[200];
uint32_t 				Temp_Raw;												/* Temperatur in 12 Bit aus ADC */
uint16_t 				Temp;														/* Temperatur in Grad Celsius */
dataset 				sensor_set[datasetCount];				/* Datensatz, der im RAM gepuffert wird */

/* Flags und Wartezeiten für den Sleep Mode */
uint16_t				sleepTimer;
uint16_t				activeTime = 300;								/* Zeit in Sekunden nach einem Ereigniss für den Sleep Mode (max 65.536 s) */
workmode_type 	operation_mode = workmode_log;	/* Betriebsmodus (Energiespar-Funktion) */
event_type 			event;													/* Event fuer die Detektierung einer Grenzwertueberschreitung */

s_accelerometerValues 			acceleration_actual_global;
s_accelerometerValuesFloat 	acceleration_actual_float;
float 											max_acceleration = 2.0;					/* Messbereich (+/-) in g */

uint8_t					g_newGPSData = 0;								/* Flag wenn neue Daten im Buffer anstehen wird von DMA IR-Handler gesetzt */
s_gpsSetOfData  gpsActualDataset;								/* Set mit aktuellsten GPS Daten */

/* Trigger-Flags fuer das Einlesen von Daten */
uint8_t 				getDataset;
uint8_t 				getTemp;
uint8_t					getLight;
uint8_t					getAcceleration;
uint8_t					getPosition;
uint8_t					writeDataset;


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_I2C3_Init(void);
static void MX_SDIO_SD_Init(void);
static void MX_SPI1_Init(void);
static void MX_USART3_UART_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void Timer4_Init(void);
void AnalogWDG_Init(void);
void error_blink(uint16_t GPIO_Pin, uint16_t n, uint16_t dt);
void writeToFile(void);

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

