FahrJo/STM32F4_Transportkontrollsystem/Src/main.c
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	
	/* Standartwerte */
	config.MAX_TEMP 						= 333;
	config.MIN_TEMP 						= 263;
	config.MAX_ACC 							= 2;
	config.ACCELERATION_ENABLE 	= 1;
	config.GNSS_ENABLE					= 1; 
	config.LIGHT_ENABLE					= 1;
	config.TEMP_ENABLE					= 1;
	config.ACC_MAX_ANZAHL_WERTE	= 20;
	
	char gpsRxRingBuffer[GPS_RINGBUFFER_SIZE] = {0};
	
	s_accelerometerValues acceleration_actual;
	//s_accelerometerValues acceleration_ringbuffer[ACC_MAX_ANZAHL_WERTE];
	HAL_StatusTypeDef i2c_status = HAL_BUSY;
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_I2C3_Init();
  MX_FATFS_Init();
  MX_SDIO_SD_Init();
  MX_SPI1_Init();
  MX_USART3_UART_Init();
  /* USER CODE BEGIN 2 */
	
	/* Vorbereiten der SD-Karte ------------------------------------------------*/
	if(f_mount(&myFatFS, SDPath, 1) == FR_OK){
		if(f_open(&configFile, configFileName, FA_READ | FA_OPEN_EXISTING) == FR_OK){
			configBuffer = calloc((f_size(&configFile) + 2), sizeof(char));		/* Reserviert Speicherbereich für den String der ganzen Konfigurationsdatei */ 
			f_read(&configFile, configBuffer, sizeof(configBuffer), &configCursor);		/* liest Konfigurationsdatei in den String für die folgende Auswertung */
			if (ini_parse_string(configBuffer, Preferences_Handler, &config) < 0) {		/* wertet den String aus und setzt die entsprechenden Parameter */
        error_blink(LED3_Pin, 5, 500);					/* wenn Lesefehler an config.ini dann blinkt orangene LED3 5 mal lang */
			}
			free(configBuffer);												/* Gibt dynamisch reservierten Speicherbereich wieder frei */
		}
		sprintf(header, "Tracking-Log;t_min:;%i;t_max:;%i;Acc_max:;%1f;\n Date/Time;Location (GPRMC);Location (GPGGA);Acceleration X; Acceleration Y; Acceleration Z;Temp;Open;Note\n", config.MIN_TEMP, config.MAX_TEMP, config.MAX_ACC);
		write_string_to_file(&logFile, logFileName, header,	sizeof(header), &cursor);
	}
	else{
		HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_SET);		/* Orangene LED3 leuchtet dauerhaft, wenn SD-Karte  nicht initialisiert werden konnte */
	}

	Timer4_Init();
	
		
	/* Acc-Sensor ueber I2C deaktivieren und dann wieder aktivieren, damit dieser sicher aktiviert wird */
	if(config.ACCELERATION_ENABLE){
		HAL_Delay(500);
		ACC_deactivate(&hi2c3);
		HAL_Delay(500);
		ACC_activate(&hi2c3);
		HAL_Delay(500);
	}
	
	/* GPS-Empfänger aktivieren ------------------------------------------------*/
	if(config.GNSS_ENABLE) {
		config.GNSS_ENABLE = 0; 										/* erst mal deaktiveren, wenn GPS aktivierung erfolgreich wird es wieder ENABLED */
		HAL_GPIO_WritePin(GPS_Reset_out_GPIO_Port, GPS_Reset_out_Pin, GPIO_PIN_SET);
		for(int i = 0; i < 4; i++){									/* wenn nach 4 Versuchen, das Modul nicht aktivert werden kann, bleibt GNSS_ENABLE=0 und das Programm lauft "normal" weiter */
			if(-1 != GPS_activateReceiver()){ 				/* GPS erfolgreich aktiviert, for-Schleife verlassen */
				config.GNSS_ENABLE=1;
				i = 5;

				/* Starte GPS UART DMA */
				HAL_UART_Receive_DMA(&huart3, (uint8_t*)&gpsRxRingBuffer, GPS_RINGBUFFER_SIZE);
				__HAL_UART_ENABLE_IT(&huart3, UART_IT_TC );
				__HAL_UART_ENABLE_IT(&huart3, UART_IT_IDLE );
			}
			else if(i == 4){
				error_blink(LED6_Pin, 5, 500);					/* wenn GPS nicht aktiviert werden kann blinkt LED6 (Blau) 5 mal lang */
			}
			HAL_Delay(100);
		}
	}

	/* Starte ADC --------------------------------------------------------------*/
	if(config.TEMP_ENABLE){
		//AnalogWDG_Init();														/* Analog Watchdog konfigurieren */
		HAL_ADC_Start_DMA(&hadc1, &Temp_Raw, 1);		/* ADC->Mem DMA starten */
		HAL_ADC_Start_IT(&hadc1);										/* ADC-WDG Interrupt aktivieren */
	}
	
	GET_DATA = config.ACCELERATION_ENABLE + config.GNSS_ENABLE + config.LIGHT_ENABLE + config.TEMP_ENABLE;		/* initialisiere Counter zum sammeln eines Datensatzes */
			
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
		
		if(getLight | getTemp | getAcceleration | getPosition | getDataset){
		
			/* Einlesen der Fotodiode und Ablage in den Datensatz ------------------*/
			if(config.LIGHT_ENABLE){
				if(getLight | getDataset){
					getLight = 0;
					getDataset--;
					
					if(HAL_GPIO_ReadPin(INT_Photodiode_GPIO_Port, INT_Photodiode_Pin) == 1){
						sensor_set[actualSet].open = 1;
					}
					else{
						sensor_set[actualSet].open = 0;
					}
				}
			}
			
			/* Einlesen der Temperatur und Ablage in den Datensatz -----------------*/
			if(config.TEMP_ENABLE){
				HAL_ADC_Start_IT(&hadc1);
				
				if(getTemp | getDataset){
					getTemp = 0;
					getDataset--;
					
					sensor_set[actualSet].temperature = 300 * 2 * Temp_Raw / 4096 - 273;    /* Umrechnung der 12-Bit Rohdaten in Grad Celsius */
					Temp = sensor_set[actualSet].temperature;
				}
			}
			
			/* Einlesen der Beschleunigungsdaten und Ablage in den Datensatz -------*/
			if(config.ACCELERATION_ENABLE){
				
				if(getAcceleration | getDataset){
					getAcceleration = 0;
					getDataset--;
					
					i2c_status = ACC_getAllValues(&hi2c3, &acceleration_actual);
					if(i2c_status == HAL_OK){
						acceleration_actual_float.x_Value = ACC_convertAccelToFloat(acceleration_actual.x_Value, 12, max_acceleration);		/* Umrechnung in Float über Registerbreite und Messbereich in g */
						acceleration_actual_float.y_Value = ACC_convertAccelToFloat(acceleration_actual.y_Value, 12, max_acceleration);		/* Umrechnung in Float über Registerbreite und Messbereich in g */
						acceleration_actual_float.z_Value = ACC_convertAccelToFloat(acceleration_actual.z_Value, 12, max_acceleration);		/* Umrechnung in Float über Registerbreite und Messbereich in g */
						sensor_set[actualSet].acceleration = acceleration_actual_float;
					}
					else{																	
						error_blink(LED5_Pin, 3, 100);			/* wenn Lesefehler dann blinkt LED5 3 mal kurz */
					}
				}
			}
			
			/* Einlesen der Positionsdaten und Ablage in den Datensatz -------------*/
			if(config.GNSS_ENABLE){
				if(getPosition | getDataset){
					getPosition = 0;
					getDataset--;
					g_newGPSData = 1; // always read in. TODO: this is a workaround as long the DMA-IRQ does not do what it should
					if(g_newGPSData){					/* check for new UART GPS Data, and read in before using GPS dataset */
						HAL_UART_DMAPause(&huart3); //pause DMA um Datenkonstistenz zu gewährleisten
						GPS_sortInNewData(&gpsActualDataset, gpsRxRingBuffer);		/* read in new data */
						HAL_UART_DMAResume(&huart3);
						g_newGPSData = 0; 									/* reset flag	*/
					}
					/* aus aktuellem GPS Set */
				//	strcpy(sensor_set[actualSet].NMEA_GPGGA, gpsActualDataset.NMEA_GPGGA);
			  //	strcpy(sensor_set[actualSet].NMEA_GPRMC, gpsActualDataset.NMEA_GPRMC); // so wenn sensorSet zweimal char[80] enthält
					sensor_set[actualSet].NMEA_GPRMC = gpsActualDataset.NMEA_GPRMC;
					sensor_set[actualSet].NMEA_GPGGA = gpsActualDataset.NMEA_GPGGA;
					// read in new time from GPS only when GPS Timestamp is newer than old timestamp form GPS. Else we jump back in time (bc. Time get incremented intern) 
					sensor_set[actualSet].timestamp = clock_time;		/* von Timer incrementiert, kann aber auch noch von GPS ab und so korrigiert werden */
				}
			}
			
			actualSet++;
		}		
		
