FahrJo/STM32F4_Transportkontrollsystem/Src/main.c
  HAL_NVIC_SetPriority(EXTI3_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI3_IRQn);

  HAL_NVIC_SetPriority(EXTI4_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI4_IRQn);

}

/* USER CODE BEGIN 4 */
void Timer4_Init(void){
	RCC->APB1ENR |= (1<<2); 											/* APB: Advanced Perifery Bridge */
	TIM4->PSC = 4200-1;														/* Prescaler fuer Timer 4 */
	TIM4->ARR = 20000-1;													/* Autoreload Limit */
	
	TIM4->DIER |= 0x1;														/* Enable Timer 4 for set an Interrupt */
	NVIC_EnableIRQ(TIM4_IRQn);										/* Enable Interrupt fuer Timer 4 */
	TIM4->CR1 |= 0x1;															/* Konfig-Register fuer Timer 4 / Channel 1 */
}

void AnalogWDG_Init(void){
	config.MAX_TEMP_RAW = config.MAX_TEMP * 4096 / 600;		/* Umrechnen der Werte von K in AD-Werte */
	config.MIN_TEMP_RAW = config.MIN_TEMP * 4096 / 600;		/* Umrechnen der Werte von K in AD-Werte */
	
	AnalogWDGConf.WatchdogMode = ADC_ANALOGWATCHDOG_ALL_REG;
	AnalogWDGConf.Channel = ADC_ALL_CHANNELS;
	AnalogWDGConf.HighThreshold = config.MAX_TEMP_RAW;
	AnalogWDGConf.LowThreshold = config.MIN_TEMP_RAW;
	AnalogWDGConf.ITMode = ENABLE;
	
	HAL_ADC_AnalogWDGConfig(&hadc1, &AnalogWDGConf);
}

void error_blink(uint16_t GPIO_Pin, uint16_t n, uint16_t dt) {		/* GPIO_Pin: Pin, n: Anzahl der Impulse, dt: Dauer der Impulse */
	for(int i = 0; i < n; i++) {
		HAL_GPIO_WritePin(LED3_GPIO_Port, GPIO_Pin, GPIO_PIN_SET);
		HAL_Delay(dt);
		HAL_GPIO_WritePin(LED3_GPIO_Port, GPIO_Pin, GPIO_PIN_RESET);
		HAL_Delay(dt);
	}
}

void writeToFile(void) {
	HAL_NVIC_DisableIRQ(TIM4_IRQn);								/* Deaktiviere zyklischen Timer Interrupt um SD-Zugriff nicht zu unterbrechen */
	write_dataset_to_file(&logFile, logFileName, sensor_set, actualSet, &cursor);		/* Schreibe Datensatz auf die Speicherkarte */
	writeDataset = 0;
	actualSet = 0;
	HAL_NVIC_EnableIRQ(TIM4_IRQn);								/* Reaktiviere zyklischen Timer Interrupt */
}


/* Interrupt Handler (ISR) ---------------------------------------------------*/

/* GPIO Interrupt Handler */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){
	operation_mode = workmode_log;								/* Ändern des Betriebsmodus in Log-Modus */
	sleepTimer = 0;																/* Zurücksetzen des Sleep-Timers bei neuem Interrupt */
	if(GPIO_Pin == User_Button_Pin){
		event = eject_card;
	}	else if(GPIO_Pin == INT_Photodiode_Pin){
		event = open_event;
	}	else if(GPIO_Pin == INT_Acceleration_Pin){
		event = moving_event;
	}	else if(GPIO_Pin == INT_Acceleration2_Pin){
		event = hit_event;
	}
}

/* Analog Watchdog Interrupt Handler */
void HAL_ADC_LevelOutOfWindowCallback(ADC_HandleTypeDef* hadc) {		
	operation_mode = workmode_log;								/* Ändern des Betriebsmodus in Log-Modus */
	sleepTimer = 0;																/* Zurücksetzen des Sleep-Timers bei neuem Interrupt */
	event = temp_event;
	HAL_GPIO_WritePin(LED5_GPIO_Port, LED5_Pin, GPIO_PIN_SET);		/* Aktivieren der roten LED als Indikator */
}

/* Zyklischer Timer interrupt im Sekundentakt */
void TIM4_IRQHandler() {												
	TIM4->SR &=~ (0x1);
	if(++sleepTimer == activeTime) {							/* Ändern des Betriebsmodus nach voreingestelter Zeit ohne Interrupt */
		operation_mode = workmode_sleep;						/* Ändern des Betriebsmodus in Ruhemodus */
		sleepTimer = 0;
	}
	if(operation_mode == workmode_log) {					/* Routine zum hochzählen der Zeit im Sekundentakt. Diese muss jedoch zu Beginn bzw. nach jedem Ruhezustand einmalig vom GPS-Signal aktualisiert werden. TODO! */
		getDataset = GET_DATA;
		if(++clock_time.tm_sec == 60) {
			clock_time.tm_sec = 0;
			if(++clock_time.tm_min == 60) {
				clock_time.tm_min = 0;
				if(++clock_time.tm_hour == 24) {
					clock_time.tm_hour = 0;
					if(++clock_time.tm_yday == 365) {
						clock_time.tm_yday = 0;
						++clock_time.tm_year;
					}
				}
			}
		}
	}
}

/* INIH Handler --------------------------------------------------------------*/

static int Preferences_Handler(void* user, const char* section, const char* name, const char* value) {
    configuration* pconfig = (configuration*)user;

    #define MATCH(s, n) strcmp(section, s) == 0 && strcmp(name, n) == 0
    if (MATCH("functions", "ACCELERATION_ENABLE")) {
        pconfig->ACCELERATION_ENABLE = atoi(value);
    } else if (MATCH("functions", "GNSS_ENABLE")) {
        pconfig->GNSS_ENABLE = atoi(value);
		}	else if (MATCH("functions", "LIGHT_ENABLE")) {
        pconfig->LIGHT_ENABLE = atoi(value);
		} else if (MATCH("functions", "TEMP_ENABLE")) {
        pconfig->TEMP_ENABLE = atoi(value);
		} else if (MATCH("values", "ACC_MAX_ANZAHL_WERTE")) {
        pconfig->ACC_MAX_ANZAHL_WERTE = atoi(value);
    } else if (MATCH("values", "MIN_TEMP")) {
        pconfig->MIN_TEMP = atoi(value);
    } else if (MATCH("values", "MAX_TEMP")) {
        pconfig->MAX_TEMP = atoi(value);
    } else if (MATCH("values", "MAX_ACC")) {
        pconfig->MAX_ACC = atof(value);
    } else {
        return 0;  															/* unknown section/name, error */
    }
		
		return 1;
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
